
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ОбщегоНазначения.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ИмеютсяОшибки = Ложь;
	
	Для Каждого СтрокаТЧ Из Исполнители Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НовыйИсполнитель) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Не указан новый исполнитель по задаче ""%1""'"), СтрокаТЧ.ЗадачаПроекта);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ИмеютсяОшибки = Истина;
		КонецЕсли;
		ОткрытИнтервал = ОбщегоНазначения.ОткрытИнтервалПоЗадаче(СтрокаТЧ.ЗадачаПроекта);
		Если ОткрытИнтервал Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Открыт рабочий интервал по задаче ""%1""'"), СтрокаТЧ.ЗадачаПроекта);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ИмеютсяОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ИмеютсяОшибки Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ИсполнителиЗадач.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Исполнители Цикл
		Движение = Движения.ИсполнителиЗадач.Добавить();
		Движение.Период = Дата;
		Движение.ЗадачаПроекта = СтрокаТЧ.ЗадачаПроекта;
		Движение.Исполнитель = СтрокаТЧ.НовыйИсполнитель;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти