
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ДатаОкончания <> Дата(1, 1, 1) И ДатаОкончания < ДатаНачала Тогда
		Текст = НСтр("ru = 'Дата окончания не может быть меньше даты начала.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ДатаНачала <> Дата(1, 1, 1) И ДатаОкончания <> Дата(1, 1, 1) Тогда
		Трудозатраты = (ДатаОкончания - ДатаНачала) / (60*60);// В часах.
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТекущееСостояние = ОбщегоНазначения.ТекущееСостояниеЗадачи(ЗадачаПроекта);
	Если ТекущееСостояние <> Перечисления.СостоянияЗадач.ВРаботе Тогда
		ОбщегоНазначения.УстановитьСостояниеЗадаче(ЗадачаПроекта, Перечисления.СостоянияЗадач.ВРаботе);
	КонецЕсли;
	
	Движения.ИнтервалыПоЗадачам.Записывать = Истина;
	Движение = Движения.ИнтервалыПоЗадачам.Добавить();
	Движение.Период = ТекущаяДатаСеанса();
	Движение.ЗадачаПроекта = ЗадачаПроекта;
	Движение.ИнтервалОткрыт = НЕ ЗначениеЗаполнено(ДатаОкончания);
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ОплатыСотрудникам.Записывать = Истина;
	Движение = Движения.ОплатыСотрудникам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ЗадачаПроекта = ЗадачаПроекта;
	Движение.Исполнитель = Исполнитель;
	Движение.Часы = Трудозатраты;
	
КонецПроцедуры

#КонецОбласти
