
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ОбщегоНазначения.ТекущийПользователь();
	ПараметрВыбора = ОбщегоНазначенияКлиентСервер.НовыйПараметрВыбораЭлемента("Отбор.Ответственный", ТекущийПользователь);
	Элементы.Владелец.ПараметрыВыбора = ПараметрВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьПроектыИИнтересы");
	
КонецПроцедуры

#КонецОбласти
