
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОплатыСотрудникам.Записывать = Истина;
	Для Каждого СтрокаЗадачи Из Задачи Цикл
		Движение = Движения.ОплатыСотрудникам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗадачаПроекта = СтрокаЗадачи.ЗадачаПроекта;
		Движение.Исполнитель = Сотрудник;
		Движение.Часы = СтрокаЗадачи.Часы;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
