
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.МесяцНачисления = НачалоМесяца(ТекущаяДатаСеанса());
	ОбновитьТаблицуНачислений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МесяцНачисленияПриИзменении(Элемент)
	
	Объект.МесяцНачисления = НачалоМесяца(Объект.МесяцНачисления);
	ОбновитьТаблицуНачислений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы

&НаКлиенте
Процедура ТаблицаНачисленияНачислитьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаНачисления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Начислить 
		И (ТекущиеДанные.Ставка = 0 ИЛИ ТекущиеДанные.Часы = 0 ИЛИ ТекущиеДанные.Сумма = 0) Тогда
		ТекущиеДанные.Начислить = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Необходимо указать ставку, часы, сумму'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Начислить(Команда)
	
	НачислитьЗП();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТаблицуНачислений()
	
	Объект.ТаблицаНачисления.Очистить();
	Долг = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СтавкиСотрудниковСрезПоследних.Ставка, 0) * ОплатыСотрудникамОстаткиИОбороты.ЧасыОборот <> 0 КАК Начислить,
	|	ОплатыСотрудникамОстаткиИОбороты.ЗадачаПроекта КАК ЗадачаПроекта,
	|	ОплатыСотрудникамОстаткиИОбороты.Исполнитель КАК Сотрудник,
	|	ОплатыСотрудникамОстаткиИОбороты.ЧасыНачальныйОстаток КАК ЧасыНачальныйОстаток,
	|	ОплатыСотрудникамОстаткиИОбороты.ЧасыОборот КАК Часы,
	|	ЕСТЬNULL(СтавкиСотрудниковСрезПоследних.Ставка, 0) КАК Ставка,
	|	ЕСТЬNULL(СтавкиСотрудниковСрезПоследних.Ставка, 0) * ОплатыСотрудникамОстаткиИОбороты.ЧасыОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.ОплатыСотрудникам.ОстаткиИОбороты(&Начало, &Конец, Месяц, , ) КАК ОплатыСотрудникамОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиСотрудников.СрезПоследних(&Начало, ) КАК СтавкиСотрудниковСрезПоследних
	|		ПО ОплатыСотрудникамОстаткиИОбороты.Исполнитель = СтавкиСотрудниковСрезПоследних.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОплатыСотрудникамОстаткиИОбороты.Исполнитель"
	;
	Запрос.УстановитьПараметр("Начало", Объект.МесяцНачисления);
	Запрос.УстановитьПараметр("Конец", КонецМесяца(Объект.МесяцНачисления));
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.ТаблицаНачисления.Загрузить(РезультатЗапроса);
	
	Для каждого СтрокаРезультат Из РезультатЗапроса Цикл
		Если СтрокаРезультат.ЧасыНачальныйОстаток = 0 Тогда
			Продолжить;
		КонецЕсли;
		Текст = СтрШаблон(НСтр("ru='Имеется долг по начислению. Сотрудник: %1. Задача:%2. Часы:%3'"),
			СтрокаРезультат.Сотрудник, СтрокаРезультат.ЗадачаПроекта, СтрокаРезультат.ЧасыНачальныйОстаток);
		Долг = Долг + Текст + Символы.ПС;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НачислитьЗП()
	
	ТаблицаКНачислению = Объект.ТаблицаНачисления.Выгрузить(Новый Структура("Начислить", Истина));
	Если ТаблицаКНачислению.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Отсутствуют данные к начислению'"));
		Возврат;
	КонецЕсли;
	
	Сотрудники = ТаблицаКНачислению.Скопировать(, "Сотрудник");
	Сотрудники.Свернуть("Сотрудник");
	
	Для каждого СтрокаСотрудник Из Сотрудники Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", СтрокаСотрудник.Сотрудник);
		СтрокиПоСотруднику = ТаблицаКНачислению.НайтиСтроки(Отбор);
		
		НовыйДокумент = Документы.ВыплатаЗарплаты.СоздатьДокумент();
		НовыйДокумент.Дата = КонецМесяца(Объект.МесяцНачисления);
		НовыйДокумент.Сотрудник = СтрокаСотрудник.Сотрудник;
		НовыйДокумент.ДатаНачала = Объект.МесяцНачисления;
		НовыйДокумент.ДатаОкончания = КонецМесяца(Объект.МесяцНачисления);
		НовыйДокумент.Автор = ОбщегоНазначения.ТекущийПользователь();
		
		Для каждого СтрокаНачисления Из СтрокиПоСотруднику Цикл
			НоваяСтрока = НовыйДокумент.Задачи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНачисления);
		КонецЦикла;
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
	ОбновитьТаблицуНачислений();
	
КонецПроцедуры

#КонецОбласти