
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ПользовательИБ = ИмяПользователя();
	НайденныйПользователь = Справочники.Пользователи.НайтиПоНаименованию(ПользовательИБ, Истина);
	Если НЕ ЗначениеЗаполнено(НайденныйПользователь) Тогда
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательОбъект.Наименование = ПользовательИБ;
		Попытка
			ПользовательОбъект.Записать();
			НайденныйПользователь = ПользовательОбъект.Ссылка;
		Исключение
			ПредставлениеОшибки = СтрШаблон(НСтр("ru='Ошибка при установке параметров сеанса.
				|Не удалось создать нового пользователя: %1'"),
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПредставлениеОшибки);
			НайденныйПользователь = Справочники.Пользователи.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	ПараметрыСеанса.ТекущийПользователь = НайденныйПользователь;
	
КонецПроцедуры
