
#Область ПрограммныйИнтерфейс

Процедура СообщитьПользователю(ТекстСообщения) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

Функция НовыйПараметрВыбораЭлемента(Имя, Значение) Экспорт
	
	НовыйПараметр = Новый ПараметрВыбора(Имя, Значение);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Возврат НовыеПараметры;
	
КонецФункции

#КонецОбласти
