
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ОбщегоНазначения.ТекущийПользователь();
	
	ЭлементОтбора = СписокЗадач.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ТекущийПользователь;
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = "ОтборТолькоМоиЗадачи";
	
	ЭлементОтбора = СписокЗадач.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтветственныйЗаПроект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ТекущийПользователь;
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = "ОтборЗадачиПоМоимПроектам";
	
	ОбновитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьПроектыИИнтересы" Тогда
		Элементы.СписокЗадач.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТолькоМоиЗадачиПриИзменении(Элемент)
	
	ОбновитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПоМоимПроектамПриИзменении(Элемент)
	
	ОбновитьОтборы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокЗадач

&НаКлиенте
Процедура СписокЗадачПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокЗадач.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ГруппаКоманды.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	ТипСтроки = ТипЗнч(Элемент.ТекущаяСтрока);
	ЭтоГруппа = (ТипСтроки = Тип("СтрокаГруппировкиДинамическогоСписка"));
	Элементы.ГруппаКоманды.Доступность = НЕ ЭтоГруппа;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтборы()
	
	ВсеОтборы = СписокЗадач.Отбор.Элементы;
	
	Для каждого ОтборСписка Из ВсеОтборы Цикл
		
		Если ОтборСписка.ИдентификаторПользовательскойНастройки = "ОтборТолькоМоиЗадачи" Тогда
			ОтборСписка.Использование = ТолькоМоиЗадачи;
		КонецЕсли;
		
		Если ОтборСписка.ИдентификаторПользовательскойНастройки = "ОтборЗадачиПоМоимПроектам" Тогда
			ОтборСписка.Использование = ЗадачиПоМоимПроектам;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
