
#Область ПрограммныйИнтерфейс

Процедура НачатьРаботыПоЗадаче(Задача) Экспорт
	
	ЭтоМояЗадача = ЭтоМояЗадача(Задача);
	Если НЕ ЭтоМояЗадача Тогда
		Текст = НСтр("ru='Нельзя начать чужую задачу.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	ОткрытИнтервал = ОбщегоНазначения.ОткрытИнтервалПоЗадаче(Задача);
	Если ОткрытИнтервал Тогда
		Текст = НСтр("ru='Интервал по задаче уже открыт.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	СостояниеЗадачи = ОбщегоНазначения.ТекущееСостояниеЗадачи(Задача);
	Если СостояниеЗадачи = Перечисления.СостоянияЗадач.Отменена
		ИЛИ СостояниеЗадачи = Перечисления.СостоянияЗадач.Выполнена Тогда
		Текст = НСтр("ru='Нельзя начать выполненные и отмененные задачи.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	УчетОбъект = Документы.УчетТрудозатратПоЗадаче.СоздатьДокумент();
	УчетОбъект.Дата = ТекущаяДата;
	УчетОбъект.ДатаНачала = ТекущаяДата;
	УчетОбъект.ЗадачаПроекта = Задача;
	УчетОбъект.Исполнитель = ОбщегоНазначения.ТекущийПользователь();
	Попытка
		УчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	Текст = СтрШаблон(НСтр("ru='Начало рабочего интервала по задаче: %1'"), Задача);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	
КонецПроцедуры

Процедура ЗакончитьРаботыПоЗадаче(Задача) Экспорт
	
	ЭтоМояЗадача = ЭтоМояЗадача(Задача);
	Если НЕ ЭтоМояЗадача Тогда
		Текст = НСтр("ru='Нельзя закончить чужую задачу.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	ОткрытИнтервал = ОбщегоНазначения.ОткрытИнтервалПоЗадаче(Задача);
	Если НЕ ОткрытИнтервал Тогда
		Текст = НСтр("ru='По задаче еще не открыт интервал.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	СостояниеЗадачи = ОбщегоНазначения.ТекущееСостояниеЗадачи(Задача);
	Если СостояниеЗадачи <> Перечисления.СостоянияЗадач.ВРаботе Тогда
		Текст = НСтр("ru='Задача должна находиться в состоянии ""В работе""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	УчетТрудозатрат = ОбщегоНазначения.НайтиДокументУчетТрудозатрат(Задача);
	Если УчетТрудозатрат = Документы.УчетТрудозатратПоЗадаче.ПустаяСсылка() Тогда
		Текст = НСтр("ru='По задаче не удалось найти документ ""Учет трудозатрат по задаче""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	УчетОбъект = УчетТрудозатрат.ПолучитьОбъект();
	УчетОбъект.ДатаОкончания = ТекущаяДатаСеанса();
	Попытка
		УчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	Текст = СтрШаблон(НСтр("ru='Конец рабочего интервала по задаче: %1'"), Задача);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	
КонецПроцедуры

Процедура ВыполнитьЗадачу(Задача) Экспорт
	
	ЭтоМояЗадача = ЭтоМояЗадача(Задача);
	Если НЕ ЭтоМояЗадача Тогда
		Текст = НСтр("ru='Нельзя выполнить чужую задачу.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	ОткрытИнтервал = ОбщегоНазначения.ОткрытИнтервалПоЗадаче(Задача);
	Если ОткрытИнтервал Тогда
		Текст = НСтр("ru='По задаче открыт рабочий интервал.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	СостояниеЗадачи = ОбщегоНазначения.ТекущееСостояниеЗадачи(Задача);
	Если СостояниеЗадачи <> Перечисления.СостоянияЗадач.ВРаботе Тогда
		Текст = НСтр("ru='Задача должна находиться в состоянии ""В работе""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.УстановитьСостояниеЗадаче(Задача, Перечисления.СостоянияЗадач.Выполнена);
	
	Текст = СтрШаблон(НСтр("ru='Выполнена задача: %1'"), Задача);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоМояЗадача(Задача)
	
	ИсполнительЗадачи = ОбщегоНазначения.ИсполнительЗадачи(Задача);
	ТекущийПользователь = ОбщегоНазначения.ТекущийПользователь();
	Возврат (ИсполнительЗадачи = ТекущийПользователь);
	
КонецФункции

#КонецОбласти
