
#Область ПрограммныйИнтерфейс

Функция ТекущийПользователь() Экспорт
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Текущий пользователь не найден'"));
	КонецЕсли;
	
	Возврат ТекущийПользователь;
	
КонецФункции

Функция ОткрытИнтервалПоЗадаче(Задача) Экспорт
	
	Отбор = Новый Структура("ЗадачаПроекта", Задача);
	ТаблицаИнтервалов = РегистрыСведений.ИнтервалыПоЗадачам.СрезПоследних(, Отбор);
	
	Если ТаблицаИнтервалов.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТаблицаИнтервалов[0].ИнтервалОткрыт;
	
КонецФункции

Функция ТекущееСостояниеЗадачи(Задача) Экспорт
	
	Отбор = Новый Структура("ЗадачаПроекта", Задача);
	ДанныеОСостоянии = РегистрыСведений.СостоянияЗадачИсполнителей.ПолучитьПоследнее(, Отбор);
	Возврат ДанныеОСостоянии.Состояние;
	
КонецФункции

Процедура УстановитьСостояниеЗадаче(Задача, Состояние) Экспорт
	
	НоваяЗапись = РегистрыСведений.СостоянияЗадачИсполнителей.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	НоваяЗапись.ЗадачаПроекта = Задача;
	НоваяЗапись.Состояние = Состояние;
	НоваяЗапись.Записать();
	
КонецПроцедуры

Функция ИсполнительЗадачи(Задача) Экспорт
	
	Отбор = Новый Структура("ЗадачаПроекта", Задача);
	ТаблицаИсполнителей = РегистрыСведений.ИсполнителиЗадач.СрезПоследних(, Отбор);
	Если ТаблицаИсполнителей.Количество() = 0 Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	Возврат ТаблицаИсполнителей[0].Исполнитель;
	
КонецФункции

Функция НайтиДокументУчетТрудозатрат(Задача) Экспорт
	
	Отбор = Новый Структура("ЗадачаПроекта", Задача);
	ТаблицаИнтервалов = РегистрыСведений.ИнтервалыПоЗадачам.СрезПоследних(, Отбор);
	Если ТаблицаИнтервалов.Количество() = 0 Тогда
		Возврат Документы.УчетТрудозатратПоЗадаче.ПустаяСсылка();
	КонецЕсли;
	Возврат ТаблицаИнтервалов[0].Регистратор;
	
КонецФункции

#КонецОбласти
