
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеВопроса = Новый ОписаниеОповещения("ОтветПользователяЗавершение", ЭтотОбъект, ПараметрКоманды);
	ПоказатьВопрос(ОписаниеВопроса, НСтр("ru='Уверены что хотите выполнить задачу?'"),
		РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, НСтр("ru='Выполнить задачу?'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтветПользователяЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.ВыполнитьЗадачу(ДополнительныеПараметры);
	Оповестить("ОбновитьПроектыИИнтересы");
	
КонецПроцедуры

#КонецОбласти