
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ОбщегоНазначения.ТекущийПользователь();
	ПараметрВыбора = ОбщегоНазначенияКлиентСервер.НовыйПараметрВыбораЭлемента("Отбор.Ответственный", ТекущийПользователь);
	Элементы.Проект.ПараметрыВыбора = ПараметрВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьПроектыИИнтересы");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ПроектПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Исполнители

&НаКлиенте
Процедура ИсполнителиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроектПриИзмененииНаСервере()
	
	Объект.Исполнители.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиПроектов.Ссылка КАК ЗадачаПроекта,
	|	ИсполнителиЗадачСрезПоследних.Исполнитель КАК Исполнитель
	|ИЗ
	|	Справочник.ЗадачиПроектов КАК ЗадачиПроектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач.СрезПоследних КАК ИсполнителиЗадачСрезПоследних
	|		ПО ЗадачиПроектов.Ссылка = ИсполнителиЗадачСрезПоследних.ЗадачаПроекта
	|ГДЕ
	|	ЗадачиПроектов.Владелец = &Проект
	|	И НЕ ЗадачиПроектов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.Исполнители.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

#КонецОбласти
