
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = ОбщегоНазначения.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ИмеютсяОшибки = Ложь;
	
	ОткрытИнтервал = ОбщегоНазначения.ОткрытИнтервалПоЗадаче(ЗадачаПроекта);
	Если ОткрытИнтервал Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Открыт рабочий интервал по задаче ""%1""'"), ЗадачаПроекта);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ИмеютсяОшибки = Истина;
	КонецЕсли;
	
	ОтветственныйЗаПроект = ЗадачаПроекта.Владелец.Ответственный;
	Если Автор <> ОтветственныйЗаПроект Тогда
		Шаблон = НСтр("ru='Отменять задачу может только ответственный за проект. Ответственный: %1.'");
		ТекстСообщения = СтрШаблон(Шаблон, ОтветственныйЗаПроект);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ИмеютсяОшибки = Истина;
	КонецЕсли;
	
	Если ИмеютсяОшибки Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движение = РегистрыСведений.СостоянияЗадачИсполнителей.СоздатьМенеджерЗаписи();
	Движение.Период = Дата;
	Движение.ЗадачаПроекта = ЗадачаПроекта;
	Движение.Состояние = Перечисления.СостоянияЗадач.Отменена;
	Движение.Записать();
	
КонецПроцедуры

#КонецОбласти
